[
  {
    "Subject": "Dis-loyalty membership program reviews and sentiment",
    "What makes people happy": "50% off new hotels (n=3), free daily barista-made drinks (n=3), 10% off food and drinks (n=2), 20% off first stay/10% off return visits (n=2), significant savings exceeding membership cost (n=2), great atmosphere/vibe/location of hotels (n=2), hotels centered around socializing (n=1), feeling appreciated (n=1), spontaneity and luxury (n=2), value for money (n=1), good customer service (n=3).",
    "What frustrates people": "App malfunctions (n=2), unclear commitment terms (n=2), inability to cancel/remove credit card (n=2), booking directly through hotels sometimes cheaper (n=2), no nearby hotels to utilize daily perks (n=1), very small rooms/no windows in some hotels (n=1), program is a scam (n=2).",
    "What people wish for": "More hotels in convenient locations for daily perks (n=1), clearer communication of terms and conditions (n=2), improved app functionality (n=2), larger rooms/rooms with windows (n=1), easier cancellation process (n=2).",
    "Pricing discovered": "$18/month or $216/year (Business Insider, March 8, 2024; Blonde Voyage 901, March 18, 2025). Discounted membership observed at $98.28 with past codes (Blonde Voyage 901, March 18, 2025). Current 25% off code: THBDIS25 (Blonde Voyage 901, March 18, 2025). Mention of saving $2,300 on a single hotel stay (God Save The Points, January 1, 2025).",
    "Target audience observed": "Individuals seeking luxury and spontaneity in travel, those who appreciate boutique hotels and unique experiences, people living near participating hotels/eateries (e.g., for daily free coffee), and travelers looking for upfront discounts rather than traditional points-based loyalty programs. Often described as 'dis-loyal' to traditional hotel chains.",
    "Key quotes": "Positive: \"On top of that, I absolutely love the Disloyalty program. It’s one of the best loyalty programs out there: I always benefit from the free drinks, great discounts, upgrades to fantastic hotels, and reduced rates. It consistently adds value to my stays and makes me feel appreciated as a customer.\" (Trustpilot, User: Simi Sachse, Sep 6, 2025)\nNegative: \"This service is essentially a scam. The app never worked properly (even costing me the free coffee benefit when it malfunctioned), booking directly through hotels was cheaper, and key terms like being locked into a year-long commitment were not clearly communicated. On top of that, they refuse to let me remove my credit card or cancel, even though the service has provided no real value. Respectfully, avoid this company at all costs and book directly with hotels instead.\" (Trustpilot, User: Anonymous, Oct 9, 2025)\nMixed: \"My only complaint is that there isn’t a hotel in this group near me! I would love to be able to utilize the free barista-made drink each day. I would also pay attention to all of the room details, as some of the smaller rooms are **very small** and some don’t have windows. So be very mindful of the room you’re booking so you aren’t surprised!\" (Blonde Voyage 901, March 18, 2025)",
    "Sample size": "n=144 reviews from Trustpilot (dates vary, some 2025) and insights from 3 articles published in 2024-2025.",
    "Data quality notes": "⭐⭐⭐ Medium confidence, data primarily from 2024-2025 (Trustpilot reviews with unknown dates are included, but articles are from 2024-2025). Limitations include a small sample size from Trustpilot (n=144) and a limited number of in-depth articles. Sentiment analysis is based on qualitative review of available text.",
    "Error": ""
  }
]