[
  {
    "Subject": "Dis-loyalty membership program on Reddit",
    "What makes people happy": "Good value/discount on first stay/new openings (n=3); Daily free coffees (n=4); Membership paid for itself through savings (n=3); Significant savings on hotel stays (n=3); Access to exclusive offers and 'drops' (n=1); No black-out dates/typical loyalty program caveats (n=1).",
    "What frustrates people": "Unknowingly committed to a full year contract despite believing it was a trial/monthly rolling (n=3); Inability to cancel the membership (n=3); Company pointing to terms and conditions when trying to cancel (n=1).",
    "What people wish for": "More locations/hotels in the group (n=1 - implied).",
    "Pricing discovered": "Under $220/year or $18/month (God Save The Points, January 1, 2025); £12/15€/$18/AED 60 a month (Dis-loyalty.com, unknown date, but mentioned in search results for 2024-2025).",
    "Target audience observed": "Travelers seeking significant discounts on hotel stays; Individuals interested in new hotel openings; People who frequent hotels like Hoxton, Mondrian, SLS, Mama Shelter, 25 Hour Hotels, SO/; Individuals working near Ennismore hotels who can utilize daily free coffees.",
    "Key quotes": "Positive: \"Pretty good value for the discount on first stay/new openings, considering it’s just monthly rolling.\" (Reddit, July 2025). Positive: \"My ex gf had this, and the membership paid for itself and some. We ended up staying at a new hotel opening, and managed to get 50% off the stay as she was a member (it was the Mondrian hotel in Ibiza).\" (Reddit, July 2025). Negative: \"When I signed up in August 2025 it was monthly rolling, but when I went to cancel month-to-month they began claiming the monthly rate is actually a yearly contract. The website now says 'Dis-loyalty is a 1-year minimum commitment'.\" (Reddit, September 2025). Negative: \"My husband and I recently booked a hotel in Dubai, and the receptionist really pushed us to sign up for this membership. They mentioned there was a trial, so we thought, ‘Why not?’ Turns out, we unknowingly committed to a full year, and the membership can’t be canceled! LOL Just a heads-up to check what you’re agreeing to because now they just point to the terms and conditions and say there’s nothing they can do.\" (Reddit, March 2025).",
    "Sample size": "n=6 relevant comments/posts from Reddit threads (r/HENRYUK, r/Asmongold) and 1 article (God Save The Points) analyzed from 2024-2025.",
    "Data quality notes": "⭐⭐⭐ Medium confidence. Data from Reddit (July 2025 - September 2025) and one promotional article (January 2025). Limited number of Reddit posts directly discussing the 'Dis-loyalty' program, leading to a small sample size for sentiment analysis. The article provides a positive, promotional view, while Reddit offers mixed user experiences.",
    "Error": ""
  }
]