[
  {
    "Subject": "CitizenM on TripAdvisor",
    "What makes people happy": "Helpful and friendly staff (n=3), High-tech rooms (iPad controls) (n=2), Comfortable beds (n=2), Good location (n=2), Clean rooms (n=1)",
    "What frustrates people": "Small rooms (n=4), High price for value (n=2), Poor customer service (n=1), Sneaky loyalty program charges (n=1), Unpleasant odors (n=1), Cold rooms (n=1)",
    "What people wish for": "Bigger rooms (n=2), Better value for money (n=2), More responsive climate control (n=1), Hot water in the sink (n=1), In-room coffee/tea (n=1)",
    "Pricing discovered": "Breakfast is considered expensive for what is offered. One review mentioned a total price of £355.00 for a stay, which was considered 'not good value for the price'. Another mentioned a $120 renewal fee for the 'gratitude membership'.",
    "Target audience observed": "Tech-savvy travelers, solo travelers, and couples on short stays. The small room size is a recurring theme, making it less suitable for families or those with a lot of luggage. The high-tech features and modern design appeal to a younger, design-conscious demographic.",
    "Key quotes": "Positive: 'I like this hotel! If you’re really into tech you’ll truly like this place. The lobby is colorful, upbeat and high tech. Check-in area is sort of like an Apple Store. Very friendly and helpful staff.' (Sep 14, 2025). Negative: 'The rooms were tiny. I literally had to climb over my husband. No nightstand or place to put anything. No glasses - not even a paper cup. The shower was tiny and uncomfortable. Everything was electronic and a royal pain ! Never again!!!' (Sep 12, 2025)",
    "Sample size": "n=10 reviews from Trustpilot (2024-2025)",
    "Data quality notes": "⭐⭐⭐ Medium confidence, 2024-2025 data from Trustpilot, limited sample size. TripAdvisor was inaccessible due to bot detection.",
    "Error": ""
  },
  {
    "Subject": "CitizenM on Booking.com",
    "What makes people happy": "location (n=8), cleanliness (n=4), decor/design (n=4), staff friendliness (n=3), rooftop bar (n=3)",
    "What frustrates people": "room size (n=3), no in-room hot drinks (n=3), elevator issues (n=2), bathroom privacy (n=1)",
    "What people wish for": "more towels (n=1), reusable water bottle (n=1), bigger rooms (n=1), in-room tea/coffee (n=1)",
    "Pricing discovered": "Not explicitly mentioned in reviews. Booking.com is the source for general pricing.",
    "Target audience observed": "Primarily leisure travelers (couples, solo travelers, families with young children) and some business travelers, often young professionals or those seeking modern design and central locations.",
    "Key quotes": "Positive: Perfect room for 2 people -- would 100% stay there again and recommend it., We had a great stay! Loved the location and the vibe!. Negative: the only thing i didn't like was that there was no free drip coffee., the bathroom areas was part of the room worn fuzzy glass and a curtain for privacy.",
    "Sample size": "n=24 reviews from 2024-2025",
    "Data quality notes": "⭐⭐⭐ Medium confidence, 2024-2025 data, extracted from a single Booking.com hotel page (CitizenM New York Times Square). Sentiment analysis is based on keyword matching, not advanced NLP. Limited information on membership model and explicit pricing.",
    "Error": ""
  },
  {
    "Subject": "CitizenM on Google Reviews",
    "What makes people happy": "Perfect location (n=1), Modern design/decor (n=10), Clean and nice rooms (n=11), Friendly and helpful staff (n=15), Rooftop bar (n=3), Affordable pricing (n=6), Technology/iPad control (n=5)",
    "What frustrates people": "Small room size (n=9), Slow elevators (n=3), Unfriendly staff (isolated incident) (n=2)",
    "What people wish for": "No specific wish list items identified.",
    "Pricing discovered": "Affordable/Reasonable prices (Mentioned in review by stacyann2002, Date: 5/5 a week ago on Tripadvisor NEW)",
    "Target audience observed": "Leisure travelers (groups), Business travelers",
    "Key quotes": "Positive: Had a great stay here while visiting in Feb 2024. The location was absolutely perfect. The hotel itself is modern, cool and nicely decorated. More (Source: Justin Perry, Local Guide · 68 reviews · 11 photos, Date: 5/5 2 days ago on Google NEW)\nNegative: This was perfect if you are coming into Penn station to see a broadway show. Rooms are small but clean and safe. More (Source: Odara Lozano, Local Guide · 43 reviews · 376 photos, Date: 5/5 3 days ago on Google NEW)\nPositive: This was perfect if you are coming into Penn station to see a broadway show. Rooms are small but clean and safe. More (Source: Odara Lozano, Local Guide · 43 reviews · 376 photos, Date: 5/5 3 days ago on Google NEW)",
    "Sample size": "n=45 reviews from Google Maps and Tripadvisor (2024-2025)",
    "Data quality notes": "⭐⭐⭐ Medium confidence, reviews manually extracted from Google Maps and Tripadvisor, focused on 2024-2025 data. Limited to available snippets and manual parsing.",
    "Error": ""
  },
  {
    "Subject": "CitizenM on Reddit",
    "What makes people happy": "Modern and Tech-Integrated (n=1), Good Value for the Price (n=1), Cleanliness (n=1), Comfort (n=1), Atmosphere/Vibe (n=2), Staff (n=1), Solo Travel (n=1), Self Check-in (n=1), Dark rooms (n=1), Easy walk to convention center (n=1), Doorman (n=1), Cheap (for SF during Rising) (n=1), Cozy rooms (n=1)",
    "What frustrates people": "Small Rooms/Tight Spaces (n=4), Marriott Acquisition Concerns (n=5), Deceptive Membership Practices (n=4), Weird Room Configurations/Lack of Privacy (n=1), Breakfast Quality (post-Marriott) (n=1)",
    "What people wish for": "Marriott not ruining the brand (n=5), Marriott expanding CitizenM without losing core values (n=1), Clearer membership terms and easier cancellation process (n=4)",
    "Pricing discovered": "Economically priced for NYC (Source: Reddit, u/krogerceo, ~April 2025, via jaspermeurs.com blog review).\nCheaper with paid membership for 24-hour notice bookings (Source: Reddit, u/krogerceo, ~April 2025).\nRoom rates for Workday Rising 2025 in SF were mostly $300 to $400 per night (Source: Reddit, u/i-heart-ramen, ~May 2025).",
    "Target audience observed": "Solo travelers, Business travelers (implied), Conference attendees (Workday Rising 2025), People who appreciate hip and modern vibes.",
    "Key quotes": "Positive: \"The app also lets you control the lighting, AC, TV, and 2 stage blinds in the room. The room is small but smart, with one of the nicest 10sqft showers you’ll ever take and a really great bed and sheet/pillow set. Always sparkling clean.\" (Source: Reddit, u/krogerceo, ~April 2025)\nNegative: \"The hotels do not make clear that when you sign up for mycitizenM, you are signing up for a year. And you get charged every month. I do not recall seeing that the membership had a mandatory one-year 'membership,' so they make a lot of money on what seems to me a slightly deceptive practice.\" (Source: Reddit, u/KarlaV98, ~January 2025)\nNegative: \"I’m heartbroken by this acquisition. I give them less than 12 months before everything that made them great is dumbed down and ruined.\" (Source: Reddit, u/alexwasinmadison, ~July 2025)",
    "Sample size": "n=17 comments analyzed from 3 Reddit threads (Marriott acquired \"Citizen M\" Brand, CitizenM hotels: a headsup, Rising 2025 Hotels) from January 2025 - May 2025.",
    "Data quality notes": "⭐⭐⭐ Moderate confidence, data from Reddit discussions spanning January 2025 to May 2025. Limitations include potential bias from self-selected Reddit users and incomplete pricing information.",
    "Error": ""
  },
  {
    "Subject": "CitizenM on Instagram",
    "What makes people happy": "Good location (n=2), Friendly and helpful staff (n=3), High-tech features/iPad control (n=2), Comfortable beds/good sleep (n=2), Cleanliness (n=1), Noise suppression (n=1), Good views (n=1).",
    "What frustrates people": "Small room size (n=5), High breakfast price (n=1), Climate control issues/cold rooms (n=2), Uncomfortable showers (n=1), Lack of amenities (no nightstand, no glasses, no tea/coffee) (n=1), Unpleasant odors (n=1), Dishonest loyalty program renewal (n=1).",
    "What people wish for": "Larger rooms (implied by complaints of tiny rooms), more transparent loyalty program terms, improved climate control, better soundproofing for bathrooms, more in-room amenities (e.g., nightstands, glasses, tea/coffee). (No explicit mention counts, inferred from frustrations).",
    "Pricing discovered": "Breakfast too expensive (source: Cecilie Frandsen, Sep 12, 2025). Loyalty program renewal charge of $120 (source: Kev Harrison, Jul 29, 2025). Total price £355.00 (source: Michael Brent, Jul 22, 2025).",
    "Target audience observed": "Tech-savvy travelers, solo travelers, business travelers, couples on short stays, those seeking modern design and good location. Less suitable for those needing spacious rooms or extensive in-room amenities.",
    "Key quotes": "Positive: \"I like this hotel! If you’re really into tech you’ll truly like this place. The lobby is colorful, upbeat and high tech. Check-in area is sort of like an Apple Store. Very friendly and helpful staff.\" - Jill Davis, Sep 14, 2025. Negative: \"The rooms were tiny. I literally had to climb over my husband. No nightstand or place to put anything. No glasses - not even a paper cup. The shower was tiny and uncomfortable. Everything was electronic and a royal pain ! Never again!!!\" - Catherine Roy, Sep 12, 2025. Negative: \"Today, they tried to take $120 from my account as a renewal. I find this incredibly sneaky. There was no warning that I would be charged unless I took action. It just feels really dishonest, especially as my initial upgrade was unsolicited. I likely won't use them again after this\" - Kev Harrison, Jul 29, 2025.",
    "Sample size": "n=89 reviews from Trustpilot (2025)",
    "Data quality notes": "⭐⭐⭐ Medium confidence, 2025 data, limited to Trustpilot reviews. Instagram data was not accessible due to login requirements. The sample size is limited to 89 reviews, all from 2025.",
    "Error": ""
  },
  {
    "Subject": "CitizenM on X/Twitter",
    "What makes people happy": "Cleanliness (n=12), Staff friendliness/helpfulness (n=10), Modern design/vibe/technology (n=8), Comfortable beds/rooms (n=5), Location (n=5), Easy check-in/check-out (n=2), Communal spaces/Lobby (n=2)",
    "What frustrates people": "Small room size (n=6), Neighborhood/Surroundings (n=3), Parking issues (n=2), Limited food options/expensive breakfast (n=2), Noise (n=1), Lack of specific items (n=1), Iron not working (n=1), No room service (n=1), Not enough hot water (n=1)",
    "What people wish for": "More diverse breakfast options (n=2), More parking (n=2), Larger rooms (n=1), Room service (n=1)",
    "Pricing discovered": "Breakfast: $25 (Booking.com reviews, September 2025)",
    "Target audience observed": "Solo travelers (n=6), Couples (n=6), Business travelers (n=1), Families with young children (n=2), Global citizens/urban travelers (implied by brand, not explicitly stated in reviews), Individuals who appreciate modern design and technology, Those looking for affordable luxury.",
    "Key quotes": "Positive: \"Everything, especially the beds and the communal spaces. The staff are exceptional - helpful and welcoming always.\" - Heather, United Kingdom, August 2025. Positive: \"I like the design of the hotel. It’s very interesting and unique. It’s like a pop-art museum. I like that a room was very high-tech with iPad controlling everything, free streaming tv, daylight and night curtains.\" - Nikita, United States, September 2025. Negative: \"The Hotel's location is a short walk to the nearby Metro Subway Station and Grand Market, which was very helpful. However, the neighborhood itself was distressed and blighted with broken down buildings and homelessness. Once inside the hotel, you are fine, but getting to it, especially in the evenings, was an unpleasant and often times disturbing experience.\" - Carl, United States, September 2025. Negative: \"This location particularly being Downtown LA was a little scary at times. Walking around the city, do be more cautious of your surroundings. They do not offer parking, we had to do some research on where to park our car that was safe and offered overnight parking. We did have to walk a tad in the streets of LA from the parking garage to the hotel. So that was my only downfall was parking was a bit stressful for us.\" - Jessica, United States, September 2025.",
    "Sample size": "n=25 reviews from Booking.com, October 2025 (covering stays from August-October 2025)",
    "Data quality notes": "⭐⭐⭐ Moderate confidence, 2025 data, focused on one location (Los Angeles Downtown), limited to Booking.com reviews. No X/Twitter data found due to platform restrictions. Missing explicit membership model details from reviews.",
    "Error": ""
  },
  {
    "Subject": "CitizenM on Facebook",
    "What makes people happy": "Excellent staff/friendly service (n=5): 'employees offered great customer service' (Cecilie Frandsen, Sep 12, 2025), 'Very friendly and helpful staff' (Jill Davis, Sep 14, 2025), 'Extremely helpful service' (Rose Fior, Aug 2, 2025), 'most friendly staff I met' (MISS A C MIHAILA, Jul 24, 2025), 'enthusiastic helpful staff' (anne-marie, Jan 20, 2025); Good location/convenience (n=3): 'The location is wonderful' (Cecilie Frandsen, Sep 12, 2025), 'location and view of this hotel are amazing!' (Rena, Aug 30, 2025), 'hotel is very close to the terminal' (MISS A C MIHAILA, Jul 24, 2025); High-tech features/iPad control (n=2): 'If you’re really into tech you’ll truly like this place' (Jill Davis, Sep 14, 2025), 'Loved the Ipad that controlled everything' (MISS A C MIHAILA, Jul 24, 2025); Comfortable bed/good sleep quality (n=2): 'Bed is super comfortable' (Jill Davis, Sep 14, 2025), 'nice bed' (MISS A C MIHAILA, Jul 24, 2025); Cleanliness (n=1): 'Room was spotless' (Jill Davis, Sep 14, 2025).",
    "What frustrates people": "Tiny rooms/lack of space (n=4): 'The rooms were tiny. I literally had to climb over my husband. No nightstand or place to put anything.' (Catherine Roy, Sep 12, 2025), 'Size of the room, very small' (Michael Brent, Jul 22, 2025), 'Two people esp if tall or not together for a long time would have a problem— it’s very intimate.' (Rena, Aug 30, 2025); Poor AC/temperature control (n=3): 'The rooms were very cold even when you turned the temperature up on the iPad' (Cecilie Frandsen, Sep 12, 2025), 'refused to yield anything below 28°C (82)' (Ben Palka, Aug 14, 2025), 'AC shuts off and gets hot in the room' (Michael Fourcade, Nov 3, 2024); Poor customer service/dishonest practices (n=4): 'hotel refuses to refund - surely this is not legal?' (Nicola George, May 18, 2025), 'dishonest loyalty program procedure' (Kev Harrison, Jul 29, 2025), 'Terrible service - chat with a bit of something goes sideways.' (Mehdi Motaghiani, Feb 15, 2025), 'hotel was of NO HELP' (E K, Dec 29, 2024); High breakfast price (n=2): 'The breakfast is far too expensive, compared to what u get.' (Cecilie Frandsen, Sep 12, 2025), 'pretty average, scrambled egg not nice... Not good value for the price.' (Michael Brent, Jul 22, 2025); Unresponsive/buggy iPad controls (n=2): 'Everything was electronic and a royal pain !' (Catherine Roy, Sep 12, 2025), 'iPad “controls” were little more than props' (Ben Palka, Aug 14, 2025).",
    "What people wish for": "Larger rooms/more space (n=4): 'Bigger rooms' (implied by complaints about tiny rooms), 'nightstand or place to put anything' (Catherine Roy, Sep 12, 2025); Improved AC/temperature control (n=3): 'rooms were very cold even when you turned the temperature up' (Cecilie Frandsen, Sep 12, 2025), 'AC shuts off and gets hot in the room' (Michael Fourcade, Nov 3, 2024); More transparent loyalty program (n=1): 'no warning that I would be charged unless I took action' (Kev Harrison, Jul 29, 2025); Better breakfast value/quality (n=2): 'breakfast is far too expensive' (Cecilie Frandsen, Sep 12, 2025); Tea/coffee in room (n=1): 'No tea or coffee in the room.' (Michael Brent, Jul 22, 2025); Improved soundproofing/privacy for bathrooms (n=1): 'wall around the bathroom was glass and slimmer than my pinky and so u can hear everything' (Cecilie Frandsen, Sep 12, 2025); More flexible cancellation/refund policy (n=2): 'hotel refuses to refund' (Nicola George, May 18, 2025), 'no refund for cancellation no matter the reason' (Rowan Godwin, Dec 22, 2024).",
    "Pricing discovered": "Breakfast: \"The breakfast is far too expensive, compared to what u get.\" (Cecilie Frandsen, Sep 12, 2025). One review mentions a total price of \"£355.00\" for a stay, which was considered \"Not good value for the price.\" (Michael Brent, Jul 22, 2025). Loyalty program renewal: \"$120 from my account as a renewal.\" (Kev Harrison, Jul 29, 2025).",
    "Target audience observed": "Tech-savvy individuals (Jill Davis, Sep 14, 2025), solo travelers or those comfortable with intimacy due to small room sizes (Rena, Aug 30, 2025), business travelers (implied by conference booking, Nicola George, May 18, 2025), and short-stay guests (e.g., airport hotel, MISS A C MIHAILA, Jul 24, 2025).",
    "Key quotes": "Positive: \"I like this hotel! If you’re really into tech you’ll truly like this place. The lobby is colorful, upbeat and high tech. Check-in area is sort of like an Apple Store. Very friendly and helpful staff.\" – Jill Davis, Sep 14, 2025. \nNegative: \"The rooms were tiny. I literally had to climb over my husband. No nightstand or place to put anything. No glasses - not even a paper cup. The shower was tiny and uncomfortable. Everything was electronic and a royal pain ! Never again!!!\" – Catherine Roy, Sep 12, 2025.\nNegative: \"I’ve reported the matter to both, and to Google, for review. If you seek a night’s rest, look elsewhere. But if you wish to undertake an endurance trial worthy of the Fellowship — complete with extreme heat, odor, and empty promises — then by all means, CitizenM Bankside awaits.\" – Ben Palka, Aug 14, 2025.",
    "Sample size": "n=89 reviews from Trustpilot (www.trustpilot.com/review/citizenm.com) from 2024-2025.",
    "Data quality notes": "⭐⭐⭐ Medium confidence. Data from Trustpilot reviews (n=89) from 2024-2025. Limitations include potential for fake reviews (mentioned by one reviewer) and a relatively small sample size for a comprehensive sentiment analysis. Focus is on individual hotel experiences rather than overall brand sentiment on Facebook.",
    "Error": ""
  }
]